Hi - So I tried it like this : [ provider version : 3.72 ] 

Ignore the for_each loop

```
resource "azurerm_pim_eligible_role_assignment" "example" {
  for_each = { for item in local.pim_eligible : item.scope => item }

  scope              = each.value.scope
  role_definition_id = data.azurerm_role_definition.example[each.value.role].id
  principal_id       = each.value.principal_id

  schedule {
    start_date_time = time_static.example.rfc3339
    expiration {
      end_date_time = "2024-09-11T11:27:44Z"
      #duration_hours = each.value.expiration_duration
    }
  }

  justification = "Expiration Duration Set"

  ticket {
    number = "1"
    system = "example ticket system"
  }
}
```
I can see that on the [documentation ](https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/pim_eligible_role_assignment)it says that I can use either of these in my expiration block : [duration_days](https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/pim_eligible_role_assignment#duration_days), [duration_hours](https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/pim_eligible_role_assignment#duration_hours), [end_date_time](https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/pim_eligible_role_assignment#end_date_time).

Initially I just passed `duration_hours` and it worked fine. Then I commented out my `duration_hours` line and added in `end_date_time` now. The expected behaviour was that it should destroy my current PIM assignment and recreate one with updated "End Time".

When I reran my plan - it shows this :

```
  # azurerm_pim_eligible_role_assignment.example["/providers/Microsoft.Management/managementGroups/mg"] will be created
  + resource "azurerm_pim_eligible_role_assignment" "example" {
      + id                 = (known after apply)
      + justification      = "Expiration Duration Set"
      + principal_id       = "XXXXXXXXXXXXXXXXXXXXXXX"
      + principal_type     = (known after apply)
      + role_definition_id = "/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7"
      + scope              = "/providers/Microsoft.Management/managementGroups/mg"

      + schedule {
          + start_date_time = "2023-09-11T11:27:44Z"

          + expiration {
              + duration_days  = (known after apply)
              + duration_hours = (known after apply)
              + end_date_time  = "2024-09-11T11:27:44Z"
            }
        }

      + ticket {
          + number = "1"
          + system = "example ticket system"
        }
    }
```

But after running terraform apply - I get this :

```
│ Error: waiting for Role Management Policy: (Principal Id "XXXXXXXXXXXXXXXXX" / Scope "/providers/Microsoft.Management/managementGroups/mg" / Role Definition Id "/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7") to be created: creating Scoped Role Eligibility Schedule Request (Scope: "/providers/Microsoft.Management/managementGroups/mg"
│ Role Eligibility Schedule Request Name: "359e7b04-9745-97ea-617b-6cdf822fcc99"): unexpected status 400 with error: RoleAssignmentRequestPolicyValidationFailed: The following policy rules failed: ["ExpirationRule"]
│
│   with azurerm_pim_eligible_role_assignment.example["/providers/Microsoft.Management/managementGroups/shubhendu-mg"],
│   on main.tf line 3, in resource "azurerm_pim_eligible_role_assignment" "example":
│    3: resource "azurerm_pim_eligible_role_assignment" "example" {
│
│ waiting for Role Management Policy: (Principal Id "XXXXXXXXXXXXXXXXXXX" / Scope "/providers/Microsoft.Management/managementGroups/mg" / Role Definition Id   
│ "/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7") to be created: creating Scoped Role Eligibility Schedule Request (Scope:
│ "/providers/Microsoft.Management/managementGroups/mg"
│ Role Eligibility Schedule Request Name: "359e7b04-9745-97ea-617b-6cdf822fcc99"): unexpected status 400 with error: RoleAssignmentRequestPolicyValidationFailed: The following policy    
│ rules failed: ["ExpirationRule"]
```